{
  "nodes": [
    {
      "op": "null", 
      "name": "data", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv0_weight", 
      "attrs": {
        "kernel": "(9, 9)", 
        "num_filter": "32", 
        "pad": "(4, 4)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv0_bias", 
      "attrs": {
        "kernel": "(9, 9)", 
        "num_filter": "32", 
        "pad": "(4, 4)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv0", 
      "attrs": {
        "kernel": "(9, 9)", 
        "num_filter": "32", 
        "pad": "(4, 4)"
      }, 
      "inputs": [[0, 0, 0], [1, 0, 0], [2, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "bn0_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn0_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn0_moving_mean", 
      "attrs": {"__init__": "[\"zero\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn0_moving_var", 
      "attrs": {"__init__": "[\"one\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "bn0", 
      "inputs": [[3, 0, 0], [4, 0, 0], [5, 0, 0], [6, 0, 1], [7, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "activation0", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[8, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "downsample0_conv_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "64", 
        "pad": "(1, 1)", 
        "stride": "(2, 2)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "downsample0_conv_bias", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "64", 
        "pad": "(1, 1)", 
        "stride": "(2, 2)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "downsample0_conv", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "64", 
        "pad": "(1, 1)", 
        "stride": "(2, 2)"
      }, 
      "inputs": [[9, 0, 0], [10, 0, 0], [11, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "downsample0_conv_gamma", 
      "attrs": {"momentum": "0.9"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "downsample0_conv_beta", 
      "attrs": {"momentum": "0.9"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "downsample0_conv_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "downsample0_conv_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "downsample0_conv", 
      "attrs": {"momentum": "0.9"}, 
      "inputs": [[12, 0, 0], [13, 0, 0], [14, 0, 0], [15, 0, 1], [16, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "activation1", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[17, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "downsample1_conv_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "128", 
        "pad": "(1, 1)", 
        "stride": "(2, 2)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "downsample1_conv_bias", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "128", 
        "pad": "(1, 1)", 
        "stride": "(2, 2)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "downsample1_conv", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "128", 
        "pad": "(1, 1)", 
        "stride": "(2, 2)"
      }, 
      "inputs": [[18, 0, 0], [19, 0, 0], [20, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "downsample1_conv_gamma", 
      "attrs": {"momentum": "0.9"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "downsample1_conv_beta", 
      "attrs": {"momentum": "0.9"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "downsample1_conv_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "downsample1_conv_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "downsample1_conv", 
      "attrs": {"momentum": "0.9"}, 
      "inputs": [[21, 0, 0], [22, 0, 0], [23, 0, 0], [24, 0, 1], [25, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "activation2", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[26, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "block0_conv_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "128", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "block0_conv_bias", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "128", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "block0_conv", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "128", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[27, 0, 0], [28, 0, 0], [29, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "block0_conv_gamma", 
      "attrs": {"momentum": "0.9"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "block0_conv_beta", 
      "attrs": {"momentum": "0.9"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "block0_conv_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "block0_conv_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "block0_conv", 
      "attrs": {"momentum": "0.9"}, 
      "inputs": [[30, 0, 0], [31, 0, 0], [32, 0, 0], [33, 0, 1], [34, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "activation3", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[35, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "block0_conv1_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "128", 
        "pad": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "block0_conv1_bias", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "128", 
        "pad": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "block0_conv1", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "128", 
        "pad": "(1, 1)"
      }, 
      "inputs": [[36, 0, 0], [37, 0, 0], [38, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "block0_bn1_gamma", 
      "attrs": {"momentum": "0.9"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "block0_bn1_beta", 
      "attrs": {"momentum": "0.9"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "block0_bn1_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "block0_bn1_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "block0_bn1", 
      "attrs": {"momentum": "0.9"}, 
      "inputs": [[39, 0, 0], [40, 0, 0], [41, 0, 0], [42, 0, 1], [43, 0, 1]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus0", 
      "inputs": [[27, 0, 0], [44, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation4", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[45, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "block1_conv_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "128", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "block1_conv_bias", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "128", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "block1_conv", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "128", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[46, 0, 0], [47, 0, 0], [48, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "block1_conv_gamma", 
      "attrs": {"momentum": "0.9"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "block1_conv_beta", 
      "attrs": {"momentum": "0.9"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "block1_conv_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "block1_conv_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "block1_conv", 
      "attrs": {"momentum": "0.9"}, 
      "inputs": [[49, 0, 0], [50, 0, 0], [51, 0, 0], [52, 0, 1], [53, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "activation5", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[54, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "block1_conv1_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "128", 
        "pad": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "block1_conv1_bias", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "128", 
        "pad": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "block1_conv1", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "128", 
        "pad": "(1, 1)"
      }, 
      "inputs": [[55, 0, 0], [56, 0, 0], [57, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "block1_bn1_gamma", 
      "attrs": {"momentum": "0.9"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "block1_bn1_beta", 
      "attrs": {"momentum": "0.9"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "block1_bn1_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "block1_bn1_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "block1_bn1", 
      "attrs": {"momentum": "0.9"}, 
      "inputs": [[58, 0, 0], [59, 0, 0], [60, 0, 0], [61, 0, 1], [62, 0, 1]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus1", 
      "inputs": [[46, 0, 0], [63, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation6", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[64, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "block2_conv_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "128", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "block2_conv_bias", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "128", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "block2_conv", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "128", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[65, 0, 0], [66, 0, 0], [67, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "block2_conv_gamma", 
      "attrs": {"momentum": "0.9"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "block2_conv_beta", 
      "attrs": {"momentum": "0.9"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "block2_conv_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "block2_conv_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "block2_conv", 
      "attrs": {"momentum": "0.9"}, 
      "inputs": [[68, 0, 0], [69, 0, 0], [70, 0, 0], [71, 0, 1], [72, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "activation7", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[73, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "block2_conv1_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "128", 
        "pad": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "block2_conv1_bias", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "128", 
        "pad": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "block2_conv1", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "128", 
        "pad": "(1, 1)"
      }, 
      "inputs": [[74, 0, 0], [75, 0, 0], [76, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "block2_bn1_gamma", 
      "attrs": {"momentum": "0.9"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "block2_bn1_beta", 
      "attrs": {"momentum": "0.9"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "block2_bn1_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "block2_bn1_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "block2_bn1", 
      "attrs": {"momentum": "0.9"}, 
      "inputs": [[77, 0, 0], [78, 0, 0], [79, 0, 0], [80, 0, 1], [81, 0, 1]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus2", 
      "inputs": [[65, 0, 0], [82, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation8", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[83, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "block3_conv_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "128", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "block3_conv_bias", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "128", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "block3_conv", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "128", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[84, 0, 0], [85, 0, 0], [86, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "block3_conv_gamma", 
      "attrs": {"momentum": "0.9"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "block3_conv_beta", 
      "attrs": {"momentum": "0.9"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "block3_conv_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "block3_conv_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "block3_conv", 
      "attrs": {"momentum": "0.9"}, 
      "inputs": [[87, 0, 0], [88, 0, 0], [89, 0, 0], [90, 0, 1], [91, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "activation9", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[92, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "block3_conv1_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "128", 
        "pad": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "block3_conv1_bias", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "128", 
        "pad": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "block3_conv1", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "128", 
        "pad": "(1, 1)"
      }, 
      "inputs": [[93, 0, 0], [94, 0, 0], [95, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "block3_bn1_gamma", 
      "attrs": {"momentum": "0.9"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "block3_bn1_beta", 
      "attrs": {"momentum": "0.9"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "block3_bn1_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "block3_bn1_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "block3_bn1", 
      "attrs": {"momentum": "0.9"}, 
      "inputs": [[96, 0, 0], [97, 0, 0], [98, 0, 0], [99, 0, 1], [100, 0, 1]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus3", 
      "inputs": [[84, 0, 0], [101, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation10", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[102, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "block4_conv_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "128", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "block4_conv_bias", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "128", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "block4_conv", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "128", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[103, 0, 0], [104, 0, 0], [105, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "block4_conv_gamma", 
      "attrs": {"momentum": "0.9"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "block4_conv_beta", 
      "attrs": {"momentum": "0.9"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "block4_conv_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "block4_conv_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "block4_conv", 
      "attrs": {"momentum": "0.9"}, 
      "inputs": [[106, 0, 0], [107, 0, 0], [108, 0, 0], [109, 0, 1], [110, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "activation11", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[111, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "block4_conv1_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "128", 
        "pad": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "block4_conv1_bias", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "128", 
        "pad": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "block4_conv1", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "128", 
        "pad": "(1, 1)"
      }, 
      "inputs": [[112, 0, 0], [113, 0, 0], [114, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "block4_bn1_gamma", 
      "attrs": {"momentum": "0.9"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "block4_bn1_beta", 
      "attrs": {"momentum": "0.9"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "block4_bn1_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "block4_bn1_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "block4_bn1", 
      "attrs": {"momentum": "0.9"}, 
      "inputs": [[115, 0, 0], [116, 0, 0], [117, 0, 0], [118, 0, 1], [119, 0, 1]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus4", 
      "inputs": [[103, 0, 0], [120, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation12", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[121, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "deconv0_weight", 
      "attrs": {
        "kernel": "(4, 4)", 
        "num_filter": "64", 
        "pad": "(1, 1)", 
        "stride": "(2, 2)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Deconvolution", 
      "name": "deconv0", 
      "attrs": {
        "kernel": "(4, 4)", 
        "num_filter": "64", 
        "pad": "(1, 1)", 
        "stride": "(2, 2)"
      }, 
      "inputs": [[122, 0, 0], [123, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "dcbn0_gamma", 
      "attrs": {"momentum": "0.9"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "dcbn0_beta", 
      "attrs": {"momentum": "0.9"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "dcbn0_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "dcbn0_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "dcbn0", 
      "attrs": {"momentum": "0.9"}, 
      "inputs": [[124, 0, 0], [125, 0, 0], [126, 0, 0], [127, 0, 1], [128, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "activation13", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[129, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "deconv1_weight", 
      "attrs": {
        "kernel": "(4, 4)", 
        "num_filter": "32", 
        "pad": "(1, 1)", 
        "stride": "(2, 2)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Deconvolution", 
      "name": "deconv1", 
      "attrs": {
        "kernel": "(4, 4)", 
        "num_filter": "32", 
        "pad": "(1, 1)", 
        "stride": "(2, 2)"
      }, 
      "inputs": [[130, 0, 0], [131, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "dcbn1_gamma", 
      "attrs": {"momentum": "0.9"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "dcbn1_beta", 
      "attrs": {"momentum": "0.9"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "dcbn1_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "dcbn1_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "dcbn1", 
      "attrs": {"momentum": "0.9"}, 
      "inputs": [[132, 0, 0], [133, 0, 0], [134, 0, 0], [135, 0, 1], [136, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "activation14", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[137, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "lastconv_weight", 
      "attrs": {
        "kernel": "(9, 9)", 
        "num_filter": "3", 
        "pad": "(4, 4)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "lastconv_bias", 
      "attrs": {
        "kernel": "(9, 9)", 
        "num_filter": "3", 
        "pad": "(4, 4)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "lastconv", 
      "attrs": {
        "kernel": "(9, 9)", 
        "num_filter": "3", 
        "pad": "(4, 4)"
      }, 
      "inputs": [[138, 0, 0], [139, 0, 0], [140, 0, 0]]
    }
  ], 
  "arg_nodes": [
    0, 
    1, 
    2, 
    4, 
    5, 
    6, 
    7, 
    10, 
    11, 
    13, 
    14, 
    15, 
    16, 
    19, 
    20, 
    22, 
    23, 
    24, 
    25, 
    28, 
    29, 
    31, 
    32, 
    33, 
    34, 
    37, 
    38, 
    40, 
    41, 
    42, 
    43, 
    47, 
    48, 
    50, 
    51, 
    52, 
    53, 
    56, 
    57, 
    59, 
    60, 
    61, 
    62, 
    66, 
    67, 
    69, 
    70, 
    71, 
    72, 
    75, 
    76, 
    78, 
    79, 
    80, 
    81, 
    85, 
    86, 
    88, 
    89, 
    90, 
    91, 
    94, 
    95, 
    97, 
    98, 
    99, 
    100, 
    104, 
    105, 
    107, 
    108, 
    109, 
    110, 
    113, 
    114, 
    116, 
    117, 
    118, 
    119, 
    123, 
    125, 
    126, 
    127, 
    128, 
    131, 
    133, 
    134, 
    135, 
    136, 
    139, 
    140
  ], 
  "node_row_ptr": [
    0, 
    1, 
    2, 
    3, 
    4, 
    5, 
    6, 
    7, 
    8, 
    11, 
    12, 
    13, 
    14, 
    15, 
    16, 
    17, 
    18, 
    19, 
    22, 
    23, 
    24, 
    25, 
    26, 
    27, 
    28, 
    29, 
    30, 
    33, 
    34, 
    35, 
    36, 
    37, 
    38, 
    39, 
    40, 
    41, 
    44, 
    45, 
    46, 
    47, 
    48, 
    49, 
    50, 
    51, 
    52, 
    55, 
    56, 
    57, 
    58, 
    59, 
    60, 
    61, 
    62, 
    63, 
    64, 
    67, 
    68, 
    69, 
    70, 
    71, 
    72, 
    73, 
    74, 
    75, 
    78, 
    79, 
    80, 
    81, 
    82, 
    83, 
    84, 
    85, 
    86, 
    87, 
    90, 
    91, 
    92, 
    93, 
    94, 
    95, 
    96, 
    97, 
    98, 
    101, 
    102, 
    103, 
    104, 
    105, 
    106, 
    107, 
    108, 
    109, 
    110, 
    113, 
    114, 
    115, 
    116, 
    117, 
    118, 
    119, 
    120, 
    121, 
    124, 
    125, 
    126, 
    127, 
    128, 
    129, 
    130, 
    131, 
    132, 
    133, 
    136, 
    137, 
    138, 
    139, 
    140, 
    141, 
    142, 
    143, 
    144, 
    147, 
    148, 
    149, 
    150, 
    151, 
    152, 
    153, 
    154, 
    155, 
    158, 
    159, 
    160, 
    161, 
    162, 
    163, 
    164, 
    165, 
    168, 
    169, 
    170, 
    171, 
    172
  ], 
  "heads": [[141, 0, 0]], 
  "attrs": {"mxnet_version": ["int", 1200]}
}